Hi @freakinhippie , thank you for the details. I dugged into the reason, this is a problem caused by the lack of several parameter values. Could you use the following two examples to configure the default properties for the resource?  I will add these two examples to the documentation to avoid the error and more confusion.

```hcl
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

# example1
resource "fortios_firewall_sslsshprofile" "t1" {
  name = "zzzzz1"

  ssl {
    inspect_all = "disable"
  }

  https {
    ports = 443
  }
  ftps {
    ports = 990
  }
  imaps {
    ports = 993
  }
  pop3s {
    ports = 995
  }
  smtps {
    ports = 465
  }
}

# example2
resource "fortios_firewall_sslsshprofile" "t2" {
  name = "zzzzz2"

  ssl {
    inspect_all = "deep-inspection"
  }

  https {
    ports = 443
  }
}
```
validation:
```
# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_sslsshprofile.t1 will be created
  + resource "fortios_firewall_sslsshprofile" "t1" {
      + allowlist                      = (known after apply)
      + block_blacklisted_certificates = (known after apply)
      + block_blocklisted_certificates = (known after apply)
      + caname                         = (known after apply)
      + dynamic_sort_subtable          = "false"
      + id                             = (known after apply)
      + mapi_over_https                = (known after apply)
      + name                           = "zzzzz1"
      + rpc_over_https                 = (known after apply)
      + server_cert                    = (known after apply)
      + server_cert_mode               = (known after apply)
      + ssl_anomalies_log              = (known after apply)
      + ssl_exemptions_log             = (known after apply)
      + ssl_negotiation_log            = (known after apply)
      + supported_alpn                 = (known after apply)
      + untrusted_caname               = (known after apply)
      + use_ssl_server                 = (known after apply)
      + whitelist                      = (known after apply)

      + ftps {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + invalid_server_cert         = (known after apply)
          + ports                       = 990
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + status                      = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }

      + https {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + invalid_server_cert         = (known after apply)
          + ports                       = 443
          + proxy_after_tcp_handshake   = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + status                      = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }

      + imaps {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + invalid_server_cert         = (known after apply)
          + ports                       = 993
          + proxy_after_tcp_handshake   = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + status                      = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }

      + pop3s {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + invalid_server_cert         = (known after apply)
          + ports                       = 995
          + proxy_after_tcp_handshake   = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + status                      = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }

      + smtps {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + invalid_server_cert         = (known after apply)
          + ports                       = 465
          + proxy_after_tcp_handshake   = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + status                      = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }

      + ssl {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + inspect_all                 = "disable"
          + invalid_server_cert         = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }
    }

  # fortios_firewall_sslsshprofile.t2 will be created
  + resource "fortios_firewall_sslsshprofile" "t2" {
      + allowlist                      = (known after apply)
      + block_blacklisted_certificates = (known after apply)
      + block_blocklisted_certificates = (known after apply)
      + caname                         = (known after apply)
      + dynamic_sort_subtable          = "false"
      + id                             = (known after apply)
      + mapi_over_https                = (known after apply)
      + name                           = "zzzzz2"
      + rpc_over_https                 = (known after apply)
      + server_cert                    = (known after apply)
      + server_cert_mode               = (known after apply)
      + ssl_anomalies_log              = (known after apply)
      + ssl_exemptions_log             = (known after apply)
      + ssl_negotiation_log            = (known after apply)
      + supported_alpn                 = (known after apply)
      + untrusted_caname               = (known after apply)
      + use_ssl_server                 = (known after apply)
      + whitelist                      = (known after apply)

      + https {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + invalid_server_cert         = (known after apply)
          + ports                       = 443
          + proxy_after_tcp_handshake   = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + status                      = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }

      + ssl {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + inspect_all                 = "deep-inspection"
          + invalid_server_cert         = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_sslsshprofile.t1: Creating...
fortios_firewall_sslsshprofile.t2: Creating...
fortios_firewall_sslsshprofile.t1: Creation complete after 0s [id=zzzzz1]
fortios_firewall_sslsshprofile.t2: Creation complete after 0s [id=zzzzz2]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewall_sslsshprofile.t2: Refreshing state... [id=zzzzz2]
fortios_firewall_sslsshprofile.t1: Refreshing state... [id=zzzzz1]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

